set_property PACKAGE_PIN F5 [get_ports ad_clock]
set_property PACKAGE_PIN F3 [get_ports ad_data_clock_n]
set_property PACKAGE_PIN F4 [get_ports ad_data_clock_p]
set_property PACKAGE_PIN L2 [get_ports ad_enable]
set_property PACKAGE_PIN D3 [get_ports ad_fb_clock_p]
set_property PACKAGE_PIN E3 [get_ports ad_fb_clock_n]
set_property PACKAGE_PIN D1 [get_ports {ad_p0_d[1]}]
set_property PACKAGE_PIN E2 [get_ports {ad_p0_d[0]}]
set_property PACKAGE_PIN D5 [get_ports {ad_p0_d[2]}]
set_property PACKAGE_PIN D6 [get_ports {ad_p0_d[3]}]
set_property PACKAGE_PIN C3 [get_ports {ad_p0_d[5]}]
set_property PACKAGE_PIN C2 [get_ports {ad_p0_d[4]}]
set_property PACKAGE_PIN B4 [get_ports {ad_p0_d[7]}]
set_property PACKAGE_PIN A3 [get_ports {ad_p0_d[6]}]
set_property PACKAGE_PIN A5 [get_ports {ad_p0_d[9]}]
set_property PACKAGE_PIN A4 [get_ports {ad_p0_d[8]}]
set_property PACKAGE_PIN B6 [get_ports {ad_p0_d[11]}]
set_property PACKAGE_PIN B5 [get_ports {ad_p0_d[10]}]
set_property PACKAGE_PIN G5 [get_ports {ad_p1_d[1]}]
set_property PACKAGE_PIN G4 [get_ports {ad_p1_d[0]}]
set_property PACKAGE_PIN G1 [get_ports {ad_p1_d[2]}]
set_property PACKAGE_PIN G2 [get_ports {ad_p1_d[3]}]
set_property PACKAGE_PIN H4 [get_ports {ad_p1_d[4]}]
set_property PACKAGE_PIN H5 [get_ports {ad_p1_d[5]}]
set_property PACKAGE_PIN H2 [get_ports {ad_p1_d[6]}]
set_property PACKAGE_PIN H1 [get_ports {ad_p1_d[7]}]
set_property PACKAGE_PIN J3 [get_ports {ad_p1_d[8]}]
set_property PACKAGE_PIN H3 [get_ports {ad_p1_d[9]}]
set_property PACKAGE_PIN J4 [get_ports {ad_p1_d[11]}]
set_property PACKAGE_PIN J5 [get_ports {ad_p1_d[10]}]
set_property PACKAGE_PIN C1 [get_ports ad_reset]
set_property PACKAGE_PIN B7 [get_ports ad_rx_frame_n]
set_property PACKAGE_PIN A7 [get_ports ad_rx_frame_p]
set_property PACKAGE_PIN K3 [get_ports ad_spi_clk]
set_property PACKAGE_PIN K2 [get_ports ad_spi_csn]
set_property PACKAGE_PIN K1 [get_ports ad_spi_miso]
set_property PACKAGE_PIN C4 [get_ports ad_spi_mosi]
set_property PACKAGE_PIN C7 [get_ports ad_tx_frame_n]
set_property PACKAGE_PIN C6 [get_ports ad_tx_frame_p]
set_property PACKAGE_PIN J1 [get_ports ad_txnrx]
set_property PACKAGE_PIN A13 [get_ports aux_io0]
set_property PACKAGE_PIN A12 [get_ports aux_io1]
set_property PACKAGE_PIN A14 [get_ports aux_scl]
set_property PACKAGE_PIN A15 [get_ports aux_sda]
set_property PACKAGE_PIN N9 [get_ports {ftdi_be[0]}]
set_property PACKAGE_PIN P8 [get_ports {ftdi_be[1]}]
set_property PACKAGE_PIN N6 [get_ports {ftdi_be[2]}]
set_property PACKAGE_PIN P6 [get_ports {ftdi_be[3]}]
set_property PACKAGE_PIN N11 [get_ports ftdi_clock]
set_property PACKAGE_PIN M16 [get_ports {ftdi_data[0]}]
set_property PACKAGE_PIN M12 [get_ports {ftdi_data[1]}]
set_property PACKAGE_PIN N16 [get_ports {ftdi_data[2]}]
set_property PACKAGE_PIN P15 [get_ports {ftdi_data[3]}]
set_property PACKAGE_PIN P16 [get_ports {ftdi_data[4]}]
set_property PACKAGE_PIN R15 [get_ports {ftdi_data[5]}]
set_property PACKAGE_PIN R16 [get_ports {ftdi_data[6]}]
set_property PACKAGE_PIN T14 [get_ports {ftdi_data[7]}]
set_property PACKAGE_PIN T15 [get_ports {ftdi_data[8]}]
set_property PACKAGE_PIN N13 [get_ports {ftdi_data[9]}]
set_property PACKAGE_PIN P13 [get_ports {ftdi_data[12]}]
set_property PACKAGE_PIN N14 [get_ports {ftdi_data[10]}]
set_property PACKAGE_PIN P14 [get_ports {ftdi_data[11]}]
set_property PACKAGE_PIN P10 [get_ports {ftdi_data[13]}]
set_property PACKAGE_PIN P11 [get_ports {ftdi_data[14]}]
set_property PACKAGE_PIN R12 [get_ports {ftdi_data[15]}]
set_property PACKAGE_PIN R13 [get_ports {ftdi_data[16]}]
set_property PACKAGE_PIN T13 [get_ports {ftdi_data[17]}]
set_property PACKAGE_PIN T12 [get_ports {ftdi_data[18]}]
set_property PACKAGE_PIN R11 [get_ports {ftdi_data[19]}]
set_property PACKAGE_PIN R10 [get_ports {ftdi_data[20]}]
set_property PACKAGE_PIN T10 [get_ports {ftdi_data[21]}]
set_property PACKAGE_PIN P9 [get_ports {ftdi_data[22]}]
set_property PACKAGE_PIN T9 [get_ports {ftdi_data[23]}]
set_property PACKAGE_PIN R8 [get_ports {ftdi_data[24]}]
set_property PACKAGE_PIN T8 [get_ports {ftdi_data[25]}]
set_property PACKAGE_PIN R7 [get_ports {ftdi_data[26]}]
set_property PACKAGE_PIN T7 [get_ports {ftdi_data[27]}]
set_property PACKAGE_PIN R6 [get_ports {ftdi_data[28]}]
set_property PACKAGE_PIN R5 [get_ports {ftdi_data[29]}]
set_property PACKAGE_PIN T5 [get_ports {ftdi_data[30]}]
set_property PACKAGE_PIN M6 [get_ports {ftdi_data[31]}]
set_property PACKAGE_PIN L15 [get_ports ftdi_oe_n]
set_property PACKAGE_PIN L14 [get_ports ftdi_rd_n]
set_property PACKAGE_PIN K13 [get_ports ftdi_rxf_n]
set_property PACKAGE_PIN K12 [get_ports ftdi_txe_n]
set_property PACKAGE_PIN L13 [get_ports ftdi_wr_n]
set_property PACKAGE_PIN B12 [get_ports led_link]
set_property PACKAGE_PIN C12 [get_ports pa_en]
set_property PACKAGE_PIN R1 [get_ports ram_clk_n]
set_property PACKAGE_PIN R2 [get_ports ram_clk_p]
set_property PACKAGE_PIN R3 [get_ports ram_csn]
set_property PACKAGE_PIN P1 [get_ports {ram_dq[0]}]
set_property PACKAGE_PIN N1 [get_ports {ram_dq[1]}]
set_property PACKAGE_PIN P3 [get_ports {ram_dq[2]}]
set_property PACKAGE_PIN M4 [get_ports {ram_dq[3]}]
set_property PACKAGE_PIN L4 [get_ports {ram_dq[4]}]
set_property PACKAGE_PIN M1 [get_ports {ram_dq[5]}]
set_property PACKAGE_PIN M2 [get_ports {ram_dq[6]}]
set_property PACKAGE_PIN P4 [get_ports {ram_dq[7]}]
set_property PACKAGE_PIN T2 [get_ports ram_rstn]
set_property PACKAGE_PIN N3 [get_ports ram_rwds]
set_property PACKAGE_PIN B15 [get_ports ref_ac]
set_property PACKAGE_PIN B16 [get_ports ref_dc]
set_property PACKAGE_PIN B14 [get_ports ref_term_en]
set_property PACKAGE_PIN D13 [get_ports sys_clock_in]
set_property IOSTANDARD LVCMOS33 [get_ports ftdi_wr_n]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[18]}]
set_property IOSTANDARD LVCMOS33 [get_ports ftdi_rxf_n]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[31]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[28]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[11]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_be[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports ftdi_oe_n]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_be[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[16]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[29]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[26]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[8]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[22]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[30]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[19]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[13]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[14]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[27]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[10]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_be[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[9]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[24]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[4]}]
set_property IOSTANDARD LVCMOS33 [get_ports ftdi_txe_n]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[6]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[20]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[17]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[25]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[7]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[12]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[15]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_be[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports ftdi_clock]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[23]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[5]}]
set_property IOSTANDARD LVCMOS33 [get_ports ftdi_rd_n]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {ftdi_data[21]}]
set_property IOSTANDARD LVCMOS33 [get_ports ref_dc]
set_property IOSTANDARD LVCMOS33 [get_ports ref_ac]
set_property IOSTANDARD LVCMOS33 [get_ports pa_en]
set_property IOSTANDARD LVCMOS33 [get_ports aux_io0]
set_property IOSTANDARD LVCMOS33 [get_ports aux_io1]
set_property IOSTANDARD LVCMOS33 [get_ports ref_term_en]
set_property IOSTANDARD LVCMOS33 [get_ports sys_clock_in]
set_property IOSTANDARD LVCMOS33 [get_ports aux_scl]
set_property IOSTANDARD LVCMOS33 [get_ports led_link]
set_property IOSTANDARD LVCMOS33 [get_ports aux_sda]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports ram_rwds]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports ram_csn]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports ram_clk_n]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports ram_clk_p]
set_property IOSTANDARD LVCMOS18 [get_ports {ram_dq[1]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports ram_rstn]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[6]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[6]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_rx_frame_n]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[3]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[3]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[11]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_rx_frame_p]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[0]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[0]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_tx_frame_n]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_clock]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_tx_frame_p]
set_property IOSTANDARD LVCMOS18 [get_ports ad_spi_mosi]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_data_clock_n]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_reset]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_data_clock_p]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[8]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_fb_clock_n]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[5]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_spi_clk]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[2]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports ad_fb_clock_p]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[2]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_spi_csn]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_txnrx]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[7]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_enable]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[4]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[4]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p1_d[1]}]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports ad_spi_miso]
set_property IOSTANDARD DIFF_SSTL18_I [get_ports {ad_p0_d[9]}]


create_clock -period 18.000 -name ad_data_clock -waveform {0.000 9.000} [get_ports ad_data_clock_p]
create_clock -period 10.000 -name ftdi_clock -waveform {0.000 5.000} [get_ports ftdi_clock]

set_property CONFIG_VOLTAGE 3.3 [current_design]
set_property CFGBVS VCCO [current_design]
set_property BITSTREAM.CONFIG.SPI_BUSWIDTH 4 [current_design]
set_property CONFIG_MODE SPIx4 [current_design]

set_property IN_TERM UNTUNED_SPLIT_50 [get_ports ad_data_clock_p]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports {ad_p1_d[1]}]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports {ad_p1_d[5]}]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports {ad_p1_d[3]}]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports {ad_p1_d[8]}]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports {ad_p1_d[6]}]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports {ad_p1_d[10]}]
set_property IN_TERM UNTUNED_SPLIT_50 [get_ports ad_rx_frame_n]


set_input_delay -clock [get_clocks ad_data_clock] 1.250 [get_ports {{ad_p1_d[0]} {ad_p1_d[1]} {ad_p1_d[2]} {ad_p1_d[3]} {ad_p1_d[4]} {ad_p1_d[5]} {ad_p1_d[6]} {ad_p1_d[7]} {ad_p1_d[8]} {ad_p1_d[9]} {ad_p1_d[10]} {ad_p1_d[11]} ad_rx_frame_n ad_rx_frame_p}]
set_input_delay -clock [get_clocks ad_data_clock] -clock_fall 1.250 [get_ports {{ad_p1_d[0]} {ad_p1_d[1]} {ad_p1_d[2]} {ad_p1_d[3]} {ad_p1_d[4]} {ad_p1_d[5]} {ad_p1_d[6]} {ad_p1_d[7]} {ad_p1_d[8]} {ad_p1_d[9]} {ad_p1_d[10]} {ad_p1_d[11]} ad_rx_frame_n ad_rx_frame_p}]


set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[30]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[6]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[0]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[0]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[24]/C}] -to [get_pins {siggen/sine_gen/ARG/B[0]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[5]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[5]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[24]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[0]}]
set_false_path -from [get_pins {siggen/reg_config_pre_reg[1]/C}] -to [get_pins {siggen/reg_config_reg[1]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[25]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[1]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[25]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[1]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[30]/C}] -to [get_pins {siggen/sine_gen/ARG/B[6]}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[7]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[7]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[24]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[24]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[13]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[13]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[30]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[30]/D}]
set_false_path -from [get_pins {siggen/reg_config_pre_reg[0]/C}] -to [get_pins {siggen/reg_config_reg[0]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[25]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[25]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[21]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[21]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[4]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[4]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[10]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[10]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[5]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[5]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[14]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[14]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[22]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[22]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[17]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[17]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[1]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[1]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[23]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[23]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[7]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[7]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[26]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[26]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[11]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[11]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[29]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[29]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[10]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[10]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[2]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[2]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[8]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[8]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[15]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[15]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[20]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[20]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[29]/C}] -to [get_pins {siggen/sine_gen/ARG/B[5]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[12]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[12]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[0]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[0]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[9]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[9]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[11]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[11]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[26]/C}] -to [get_pins {siggen/sine_gen/ARG/B[2]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[16]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[16]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[27]/C}] -to [get_pins {siggen/sine_gen/ARG/B[3]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[4]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[4]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[28]/C}] -to [get_pins {siggen/sine_gen/ARG/B[4]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[6]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[6]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[18]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[18]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[29]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[5]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[31]/C}] -to [get_pins {siggen/sine_gen/ARG/B[7]}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[3]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[3]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[1]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[1]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[31]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[31]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[8]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[8]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[31]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[7]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[3]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[3]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[26]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[2]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[27]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[3]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[9]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[9]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[2]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[2]/D}]
set_false_path -from [get_pins {siggen/reg_sine_iq_offset_pre_reg[6]/C}] -to [get_pins {siggen/reg_sine_iq_offset_reg[6]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[28]/C}] -to [get_pins {siggen/sine_gen/ARG__0/B[4]}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[27]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[27]/D}]
set_false_path -from [get_pins {siggen/reg_sine_amp_freq_pre_reg[28]/C}] -to [get_pins {siggen/reg_sine_amp_freq_reg[28]/D}]
